# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [4]:
a=pd.Series(np.random.randint(1,4,100))
b=pd.Series(np.random.randint(1,3,100))
c=pd.Series(np.random.randint(10000,30000,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
housing=pd.concat([a,b,c],axis=1)
housing

    0  1      2
0   2  2  24862
1   2  2  26182
2   1  1  12997
3   3  2  19778
4   1  2  22550
.. .. ..    ...
95  1  2  28547
96  2  2  18537
97  1  2  26614
98  1  1  29496
99  2  1  11278

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
housing.columns=("berds","bathrs","price_sqr_meter")
housing

    berds  bathrs  price_sqr_meter
0       2       2            24862
1       2       2            26182
2       1       1            12997
3       3       2            19778
4       1       2            22550
..    ...     ...              ...
95      1       2            28547
96      2       2            18537
97      1       2            26614
98      1       1            29496
99      2       1            11278

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [7]:
bigcolumn = pd.concat([a, b, c], axis=0)
bigcolumn.to_frame()

        0
0       2
1       2
2       1
3       3
4       1
..    ...
95  28547
96  18537
97  26614
98  29496
99  11278

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reset_index(drop=True)
bigcolumn.to_frame()

         0
0        2
1        2
2        1
3        3
4        1
..     ...
295  28547
296  18537
297  26614
298  29496
299  11278

[300 rows x 1 columns]

In [10]:
bigcolumn = pd.concat([a, b, c], axis=0,ignore_index=True)
bigcolumn.to_frame()

         0
0        2
1        2
2        1
3        3
4        1
..     ...
295  28547
296  18537
297  26614
298  29496
299  11278

[300 rows x 1 columns]